{
  "id": "ci:antipattern.friction-ontology",
  "version": "0.1",
  "status": "draft",
  "title": "The Friction Ontology",
  "author": "Rashid Azarang",
  "sections": [
    {
      "title": "Description",
      "content": "The Friction Ontology is a diagnostic framework for identifying specific architectural patterns that inhibit clarity, continuity, and evolution in intelligent systems. It provides a taxonomy of recurring clarity frictions that appear across different domains, scales, and technologies.\n\nA clarity friction is not merely an operational issue or technical glitch. It represents an epistemic dissonance—a signal that a system has begun to forget how to know itself. These frictions occur where a system's structural patterns no longer adequately contain or process the complexity they're being asked to manage.\n\nThe fundamental shift in the Friction Ontology is viewing frictions not as problems to eliminate but as signals to interpret. Each friction contains not just information about current limitations but intelligence about future possibilities. They are not noise in the system but signal—communication from structures under pressure indicating where and how evolution wants to occur."
    },
    {
      "title": "When to Use",
      "content": "The Friction Ontology is most effective in these situations:\n\n- When recurring operational problems resist resolution despite multiple fix attempts\n- During digital transformation initiatives to identify architectural rather than technological barriers\n- In organizational change efforts to distinguish symptoms from structural causes\n- When technical debt assessment feels incomplete or superficial\n- During merger/acquisition technical due diligence to identify hidden structural risks\n- In new system design to avoid replicating architectural anti-patterns\n- For strategic planning to identify where evolution pressure is building in existing systems"
    },
    {
      "title": "Inputs and Outputs",
      "content": "**Inputs:**\n- Recurring operational pain points and their patterns\n- Historical improvement attempts and their outcomes\n- Organizational narratives about system challenges\n- Technical system documentation and architecture\n- Stakeholder interviews across different organizational levels\n- User experience reports and feedback patterns\n- System performance and error metrics over time\n\n**Outputs:**\n- Classification of operational frictions into architectural patterns\n- Diagnosis of underlying structural causes rather than symptoms\n- Identification of evolutionary pressures building in the system\n- Prioritization framework based on friction severity and structural impact\n- Strategic recommendations for architectural intervention\n- Direction for structural evolution rather than symptomatic fixes\n- Cross-domain pattern recognition connecting seemingly unrelated issues"
    },
    {
      "title": "Procedure",
      "content": "The Friction Ontology identifies eight core patterns that recur across different domains, scales, and technologies:\n\n**1. Ballup**\n- Definition: A recurring friction point that persists despite repeated fixes, indicating structural evolution-in-waiting rather than mere operational inefficiency\n- Diagnostic questions: Does this problem keep returning despite multiple resolution attempts? Do fixes seem to work temporarily but the issue resurfaces? Is the same problem addressed repeatedly in different ways?\n- Structural signal: Current architecture can no longer adequately hold the complexity it faces\n\n**2. Semantic Drift**\n- Definition: The quiet erosion of meaning where key terms are used inconsistently across different contexts, creating apparent agreement that masks fundamental misalignment\n- Diagnostic questions: Do the same terms mean different things to different teams? Do discussions reveal hidden definitional disagreements? Is there frequent need for translation between groups?\n- Structural signal: Memory of meaning fades without active governance\n\n**3. Dashboard Theater**\n- Definition: A pattern where visibility masquerades as understanding, creating sophisticated interfaces that display information without driving action or insight\n- Diagnostic questions: Are dashboards visually impressive but rarely used for decisions? Is there persistent debate about \"real\" numbers despite available reports? Is there heavy analyst dependency for interpretation?\n- Structural signal: Interface layer overcompensates for weaknesses in logic and data\n\n**4. Hero Syndrome**\n- Definition: A dependency on specific individuals who hold critical knowledge or perform essential functions through heroic effort\n- Diagnostic questions: Is there anxiety when key people take vacation? Do certain individuals regularly \"save the day\"? Is institutional knowledge concentrated rather than distributed?\n- Structural signal: Memory and structure have failed to externalize intelligence from individuals into systems\n\n**5. Cognitive Amnesia**\n- Definition: The pattern where systems repeatedly solve the same problems without retaining or building on previous solutions\n- Diagnostic questions: Does the organization rediscover the same insights repeatedly? Are solutions reinvented rather than evolved? Is there poor connection to historical decisions and context?\n- Structural signal: Memory mechanisms have failed despite apparent sophistication\n\n**6. Trigger Chaos**\n- Definition: A condition where automations and workflows operate through invisible or fragmented logic, creating unpredictable behavior when conditions change\n- Diagnostic questions: Are automated processes frequently breaking in unexpected ways? Is there limited visibility into automation decision paths? Do small changes create cascading failures?\n- Structural signal: Orchestration has outpaced feedback capability\n\n**7. Metric Mirage**\n- Definition: The collection of measurements that don't influence behavior or drive evolution, creating the appearance of feedback without its function\n- Diagnostic questions: Are metrics collected but not actively used? Do reports exist but not drive changes? Is measurement disconnected from decision-making?\n- Structural signal: Feedback loops don't close\n\n**8. Overlayering**\n- Definition: The accumulation of complexity without corresponding refactoring, creating systems that exceed cognitive capacity to understand or modify\n- Diagnostic questions: Is system behavior increasingly unpredictable? Do changes require extensive coordination across multiple components? Is documentation inadequate to capture actual system behavior?\n- Structural signal: Evolution has occurred without simplification\n\nFor each identified friction pattern:\n\n1. **Document Observable Manifestations**\n   - Catalog specific examples where the pattern appears\n   - Note frequency, severity, and business impact\n   - Record stakeholder language used to describe the friction\n\n2. **Analyze Structural Origins**\n   - Map the friction to relevant modal layers\n   - Identify architectural gaps or imbalances\n   - Assess historical evolution that created the condition\n\n3. **Interpret Evolutionary Signal**\n   - Determine what the system is trying to become\n   - Identify where pressure is building for structural change\n   - Recognize emergent patterns seeking expression\n\n4. **Formulate Architectural Response**\n   - Design interventions that address structural causes rather than symptoms\n   - Create evolution pathway that leverages existing energy\n   - Balance short-term friction reduction with long-term architectural health"
    },
    {
      "title": "Cross-links",
      "content": "The Friction Ontology connects to several other Cognitive Infrastructure concepts:\n\n- **Clarity Laws**: Provide the underlying principles for why these friction patterns emerge\n- **Modal Layer Architecture**: Helps locate where in the system architecture each friction originates\n- **Structure-Memory-Interaction Triad**: Maps frictions to breakdowns in structure, memory, or interaction\n- **Structural Debt**: Frictions represent manifestations of accumulated structural debt\n- **Universal Evolutionary Stages**: Each friction indicates a system struggling to evolve to a higher stage\n- **System Autopsy**: Diagnostic methodology that reveals these friction patterns in operational systems\n\nThis entry expands significantly on the existing Friction Ontology concept by detailing each pattern, providing diagnostic questions, and articulating a structured procedure for interpretation and response."
    }
  ]
}