{
  "id": "ci:antipattern.layer-maturity-grid",
  "version": "0.1",
  "status": "draft",
  "title": "Layer-Maturity Grid",
  "author": "Rashid Azarang",
  "sections": [
    {
      "title": "Description",
      "content": "The Layer-Maturity Grid is a diagnostic tool that maps the maturity of each modal layer (Data, Logic, Interface, Orchestration, Feedback) against an evolutionary scale, creating a visual representation of a system's architectural balance. This assessment reveals characteristic patterns of development, architectural imbalances, and potential friction points.\n\nThe grid visualizes where different aspects of a system stand on their evolutionary journey, showing not just the overall system maturity but the distribution of maturity across different functions. This reveals patterns like Dashboard Mirage (advanced interfaces built on weak foundations) or Trigger Chaos (orchestration outpacing feedback capability).\n\nBy examining the grid, organizations can identify where architectural imbalances create operational friction and determine whether to prioritize advancement in less mature layers or maintain balanced evolution across all layers."
    },
    {
      "title": "When to Use",
      "content": "The Layer-Maturity Grid is most valuable in these situations:\n\n- During strategic technology planning\n- When diagnosing recurring operational issues\n- Before investing in new capabilities or tools\n- As part of merger/acquisition technical due diligence\n- When aligning cross-functional improvement initiatives\n- For tracking architectural evolution over time\n- In communication with executives about technical debt\n- When prioritizing architectural investments\n\nIt's particularly useful when comparing different operational domains within an organization to identify patterns of uneven development or when assessing the architectural implications of proposed changes."
    },
    {
      "title": "Inputs and Outputs",
      "content": "**Inputs:**\n- Detailed understanding of current capabilities across all modal layers\n- Knowledge of evolutionary stages and their characteristics\n- Examples of operational successes and pain points\n- Stakeholder experiences from different organizational levels\n- Historical context about system evolution\n- Technical documentation and architecture diagrams\n- Process maps and workflow documentation\n- Integration patterns between systems and components\n\n**Outputs:**\n- Visual representation of architectural maturity distribution\n- Identification of characteristic patterns (Dashboard Mirage, Trigger Chaos, etc.)\n- Layer imbalance analysis showing maturity gaps\n- Architectural risk assessment based on imbalances\n- Strategic priorities for balanced advancement\n- Evolution roadmap showing maturity progression\n- Communication tool for explaining architectural challenges\n- Benchmark for measuring architectural improvement over time"
    },
    {
      "title": "Procedure",
      "content": "The Layer-Maturity Grid follows a structured assessment process:\n\n**1. Preparation Phase**\n- Create a grid with five rows (one for each modal layer) and eight columns (one for each evolutionary stage, 0-7)\n- Review the characteristics of each modal layer at each evolutionary stage\n- Gather relevant documentation and stakeholder perspectives\n- Establish assessment criteria and evidence requirements\n- Assemble a cross-functional assessment team with diverse viewpoints\n\n**2. Assessment Phase**\n- For each modal layer, evaluate current capabilities against stage characteristics\n- Determine the highest stage where the organization consistently demonstrates capabilities\n- Document specific examples and evidence supporting the assessment\n- Note variations across different departments or functional areas\n- Identify dependencies between layers that affect maturity\n\n**3. Grid Visualization**\n- Mark the assessed maturity level for each layer on the grid\n- Create a visual representation showing the overall pattern\n- Highlight the maturity range (highest to lowest layer)\n- Identify the \"limiting layer\" with lowest maturity\n- Calculate metrics like average maturity and standard deviation\n\n**4. Pattern Recognition**\n- Analyze the grid for characteristic patterns:\n  - Dashboard Mirage: Advanced Interface layer, weak Data/Logic layers\n  - Trigger Chaos: Advanced Orchestration layer, weak Feedback layer\n  - Metastable Intelligence: Wide variation in layer maturity\n  - Balanced Evolution: Consistent maturity across all layers\n- Identify whether the pattern matches known anti-patterns\n- Determine if certain layers consistently lag across domains\n\n**5. Strategic Analysis**\n- Evaluate business impact of identified imbalances\n- Assess risk level based on maturity gaps between connected layers\n- Determine appropriate advancement strategy:\n  - Foundation strengthening (focus on lagging layers)\n  - Balanced advancement (maintain even maturity)\n  - Targeted evolution (strategic advancement in specific areas)\n- Define target architecture with improved balance\n- Create evolution pathway with intermediate milestones\n\n**6. Action Planning**\n- Prioritize architectural investments based on critical imbalances\n- Develop specific initiatives to address layer gaps\n- Create metrics to track architecture balancing progress\n- Establish governance to maintain balance during evolution\n- Plan communication to build stakeholder understanding\n- Integrate findings with broader technology roadmap"
    },
    {
      "title": "Cross-links",
      "content": "The Layer-Maturity Grid connects to several other Cognitive Infrastructure concepts:\n\n- **Modal Layer Architecture**: Defines the five layers assessed in the grid\n- **Universal Evolutionary Stages**: Provides the maturity scale (0-7) for assessment\n- **Clarity Mapping Worksheet**: Provides a structured format for creating the grid\n- **Maturity vs. Balance 2×2**: Offers a simplified strategic view of grid results\n- **Clarity Laws**: The first law (\"you don't rise above your weakest layer\") explains why grid patterns matter\n- **Dashboard Theater**: A manifestation of the Dashboard Mirage pattern in the grid\n- **Trigger Chaos**: Appears in the grid as advanced Orchestration with lagging Feedback\n- **Continuity-Disruption Balance**: Influences appropriate evolution strategies based on grid analysis\n\nThis diagnostic tool provides a structured implementation of core Cognitive Infrastructure principles, creating a practical bridge between theory and application."
    }
  ]
}