{
  "id": "ci:pattern.clarity-mapping-worksheet",
  "version": "0.1",
  "status": "draft",
  "title": "Clarity Mapping Worksheet",
  "author": "Rashid Azarang",
  "sections": [
    {
      "title": "Description",
      "content": "The Clarity Mapping Worksheet is a structured diagnostic tool for assessing the current state of a system's cognitive infrastructure. It creates a visual heat map of strengths, weaknesses, and imbalances across the modal layers and maturity levels, enabling stakeholders to see architectural patterns that might otherwise remain invisible.\n\nThe worksheet takes the form of a matrix where rows represent the five modal layers (Data, Logic, Interface, Orchestration, Feedback) and columns represent the eight maturity levels (0-7). Each cell represents a specific layer at a specific maturity level, with color-coding or numerical values indicating the current state, target state, and gaps between them.\n\nThis tool helps teams move beyond generic assessments like \"our data needs work\" to precise diagnoses like \"our data layer is at Stage 2 (basic digitization) while our interface layer is at Stage 5 (contextual adaptation), creating a dangerous architectural imbalance.\""
    },
    {
      "title": "When to Use",
      "content": "The Clarity Mapping Worksheet is most valuable in these situations:\n\n- As part of strategic planning for digital transformation\n- When prioritizing technology investments\n- For capability gap analysis across organizational functions\n- During system integration planning after mergers/acquisitions\n- When diagnosing recurring operational friction\n- As a baseline assessment before major system changes\n- For tracking architectural evolution over time\n- In communication with stakeholders about system health and improvement needs\n\nIt's particularly effective when completed collaboratively by cross-functional teams, as the process of completing the worksheet often reveals differing perspectives and hidden assumptions about system capabilities."
    },
    {
      "title": "Inputs and Outputs",
      "content": "**Inputs:**\n- Detailed understanding of each modal layer's current capabilities\n- Knowledge of the organization's strategic priorities and goals\n- Perspective from both technical and business stakeholders\n- Examples of current friction points and operational challenges\n- Understanding of the Universal Evolutionary Stages framework\n- Assessment of capabilities across different functional areas\n- Historical context of system evolution and previous investments\n- Experience from users and operators of current systems\n\n**Outputs:**\n- Visual representation of architectural strengths and weaknesses\n- Identification of layer imbalances and maturity gaps\n- Clear priorities for architectural investment\n- Shared understanding of current state across stakeholders\n- Target architecture based on strategic needs\n- Evolution roadmap showing intermediate stages\n- Risk assessment based on critical gaps\n- Foundation for investment business cases"
    },
    {
      "title": "Procedure",
      "content": "The Clarity Mapping Worksheet follows a structured process:\n\n**1. Setup Phase**\n- Create a matrix with five rows (one for each modal layer) and eight columns (one for each maturity level)\n- Review the characteristics of each modal layer and maturity level to ensure common understanding\n- Establish evaluation criteria for each layer-maturity combination\n- Decide on a visual coding system (colors, numbers, symbols) to represent current state\n\n**2. Assessment Phase**\n- For each modal layer, evaluate current capabilities against maturity level descriptions\n- Mark the highest level where the organization consistently demonstrates the capabilities\n- Document specific examples supporting the assessment\n- Add qualitative notes explaining the assessment with business context\n- Identify areas where different functions or departments are at different levels\n\n**3. Analysis Phase**\n- Examine the resulting pattern for layer balance: Are some layers significantly more advanced than others?\n- Identify the least mature layer as a potential bottleneck\n- Assess alignment between adjacent layers\n- Evaluate the overall maturity band (the range covering most layers)\n- Identify outliers that stand out (either advanced or lagging)\n- Determine if the pattern corresponds to a known architectural archetype (e.g., Dashboard Theater, Metastable Intelligence)\n\n**4. Gap Analysis Phase**\n- Identify the largest maturity gaps between adjacent layers\n- Determine which gaps create the most operational friction or risk\n- Document missing capabilities at critical layers\n- Prioritize gaps based on business impact\n- Develop recommendations for targeted improvement\n\n**5. Target Setting Phase**\n- Establish a target architecture based on strategic needs\n- Balance aspirational goals with realistic evolution paths\n- Ensure the target maintains layer balance\n- Identify intermediate evolution stages\n- Create a roadmap showing evolution sequence\n- Establish metrics to track progress toward targets\n\n**6. Communication Phase**\n- Present findings visually to stakeholders\n- Explain architectural patterns and their implications\n- Connect technical assessment to business outcomes\n- Use the worksheet to build consensus on priorities\n- Document both current state and improvement path"
    },
    {
      "title": "Cross-links",
      "content": "The Clarity Mapping Worksheet connects to several other Cognitive Infrastructure concepts:\n\n- **Modal Layer Architecture**: Defines the five layers assessed in the worksheet\n- **Universal Evolutionary Stages**: Provides the maturity scale (0-7) used for assessment\n- **Layer-Maturity Grid**: Represents the same conceptual structure in a different format\n- **Maturity vs. Balance 2×2**: Provides a high-level interpretation of worksheet results\n- **Friction Ontology**: Helps connect observed patterns to specific friction types\n- **Clarity Laws**: Explains why the patterns observed in the worksheet matter\n- **Continuity-Disruption Balance**: Guides appropriate evolution strategies based on assessment\n\nThis diagnostic tool operationalizes several core Cognitive Infrastructure concepts, creating a practical application of the theoretical framework."
    }
  ]
}